Repository: ic1998/Cor-En
Catalog: TMX_datasets/9_en_kw.tmx
Source language: en
Languages: kw

source: Hurry up.
kw: Gwra fistena.

source: I have to go to bed.
kw: Res yw dhymm mos dhe’n gweli.

source: I love you.
kw: My a’th kar.

source: Congratulations!
kw: Keslowena!

source: I'm tired.
kw: Skwith ov.

source: I have a headache.
kw: Yma drog penn dhymm.

source: Merry Christmas!
kw: Nadelik Lowen!

source: I am married and have two children.
kw: Demedhys ov hag yma dhymm dew flogh.

source: It's cold.
kw: Yeyn yw.

source: I'm thirsty.
kw: Yma sehes dhymm.

source: I don't want to go to school.
kw: Ny vynnav vy mos dhe'n skol.

source: It is raining.
kw: Yma ow kul glaw.

source: I read a book while eating.
kw: My a redyas lyver ha my ow tybri.

source: My little brother is watching TV.
kw: Yma ow broder byghan ow mires orth an bellwolok.

source: Where is the bathroom?
kw: Ple'ma an stevel-omwolghi?

source: Where are you?
kw: Ple’th esos ta?

source: They are waiting for you in front of the door.
kw: Ymons i orth dha wortos a-dherag an daras.

source: I liked this film.
kw: Da o genev an fylm ma.

source: Why do you want to leave today?
kw: Prag y fynn'ta diberth hedhyw?

source: How beautiful you are!
kw: Ass os ta teg!

source: You must work more.
kw: Res yw dhis oberi moy.

source: You don't have to come tomorrow.
kw: Nyns yw res dhis dos a-vorow.

source: I have to write a letter. Do you have some paper?
kw: Res yw dhymm skrifa lyther. Eus genes paper?

source: You must practice grammar.
kw: Res yw dhis praktisya gramer.

source: You can't ride a horse.
kw: Ny yll'ta marhogeth margh.

source: Do you live here?
kw: Os ta trigys omma?

source: You have to go.
kw: Res yw dhis mos.

source: Are you happy?
kw: Os ta lowen?

source: I suppose you're hungry.
kw: Gwag os, dell dybav.

source: How many books do you have?
kw: Py lies lyver eus dhis?

source: What are you looking for?
kw: Pyth esowgh hwi ow hwilas?

source: You can swim, can't you?
kw: Ty a yll neuvya, a ny yll'ta?

source: Can you swim?
kw: A wodhes ta neuvya?

source: Don't you like apples?
kw: A nyns yw da genes avalow?

source: You must study more.
kw: Res yw dhis studhya moy.

source: Why do you want to buy this book?
kw: Prag y fynn'ta prena an lyver ma?

source: What are you doing?
kw: Pyth esos ta ow kul?

source: You have many books.
kw: Yma dhis lies lyver.

source: You will catch cold.
kw: Ty a wra anwosi.

source: You need to have breakfast.
kw: Res yw dhis kavos hansel.

source: Where are your eyes?
kw: Ple’ma dha dhewlagas?

source: Where do you come from?
kw: A ble’th os ta devedhys?

source: Where is your school?
kw: Ple’ma dha skol?

source: Your dress is very nice.
kw: Pur deg yw dha bows.

source: You didn't need to hurry.
kw: Nyns o res dhis fistena.

source: Who is your teacher?
kw: Piw yw dha dhyskador?

source: The sky is blue.
kw: Glas yw an ebron.

source: Fish, please.
kw: Pysk, mar pleg.

source: Do you like fish?
kw: Yw da genes pysk?

source: Will you drink wine instead of milk?
kw: A vyn’ta eva gwin yn le leth?

source: You don't have to hurry.
kw: Nyns yw res dhis fistena.

source: We didn't need to hurry.
kw: Nyns o res dhyn fistena.

source: I must hurry to class.
kw: Res yw dhymm fistena dhe glass.

source: The customer did not come.
kw: Ny dheuth an prener.

source: You are beautiful.
kw: Teg os ta.

source: You have three cars.
kw: Yma tri harr dhis.

source: Take care.
kw: Kemmer with.

source: Never mind.
kw: Na fors.

source: Never mind!
kw: Na fors!

source: Is there a pen on the desk?
kw: Eus pluven war an desk?

source: I try.
kw: My a wra assaya.

source: Do you remember?
kw: Eus kov dhis?

source: I did see him.
kw: My a wrug y weles.

source: You can't go out.
kw: Ny yll'ta mos yn-mes.

source: Good morning, everybody.
kw: Myttin da, oll an bys!

source: Good morning, everyone.
kw: Myttin da, oll an bys!

source: We must water the flower.
kw: Res yw dhyn dowra an vleujen.

source: We have two television sets.
kw: Yma diw bellwolok dhyn.

source: Do you like summer?
kw: Yw da genes hav?

source: What do you want to do?
kw: Pandr’a vyn’ta dhe wul?

source: I can't say.
kw: Ny allav vy leverel.

source: What are you going to do?
kw: Pandr’a vyn’ta dhe wul?

source: I have to do something.
kw: Res yw dhymm gul neppyth.

source: I can't do it.
kw: Ny allav vy y wul.

source: I had to run to the station.
kw: Res o dhymm ponya dhe'n gorsav.

source: Can you speak English?
kw: A wodhesta kewsel Sowsnek?

source: Speaking English is very difficult for me.
kw: Pur gales yw ragov kewsel Sowsnek.

source: Speaking English is not easy.
kw: Nyns yw es kewsel Sowsnek.

source: To speak English is not easy.
kw: Nyns yw es kewsel Sowsnek.

source: Must I speak English?
kw: Yw res dhymm kewsel Sowsnek?

source: You had to study English.
kw: Res o dhis studhya Sowsnek.

source: English is the world's language.
kw: Sowsnek yw yeth an bys.

source: English is not easy for me.
kw: Nyns yw Sowsnek es ragov.

source: Is English spoken in Canada?
kw: A gewsir Sowsnek yn Canada?

source: Must I answer in English?
kw: Yw res dhymm gorthebi yn Sowsnek?

source: It was raining.
kw: Yth esa hi ow kul glaw.

source: You must see a doctor.
kw: Res yw dhis gweles medhek.

source: Is that all?
kw: Yw henna oll?

source: I have a cat and a dog.
kw: Yma dhymm kath ha ki.

source: I am more beautiful than you.
kw: Tekka ov agesos sy.

source: I am eating an apple.
kw: Yth esov vy ow tybri aval.

source: Do you like apples?
kw: Yw da genes avalow?

source: Some apples fell down from the tree.
kw: Nebes avalow a godhas yn-nans a’n wedhen.

source: I can't sleep well.
kw: Ny allav koska yn ta.

source: I can't hear very well.
kw: Ny allav vy klewes yn ta.

source: There was thunder and lightning last night.
kw: Yth esa taran ha lughes nyhewer.

source: It may rain soon.
kw: Martesen y hwra glaw kyns pell.

source: If I had enough money, I would buy that nice car.
kw: Mar pe arghans lowr dhymm, prena an karr-tan teg-na a wrussen.

source: If it were Sunday today, we would go fishing.
kw: Mar pe dy’Sul hedhyw, ni a wrussa mos dhe byskessa.

source: I have to leave now.
kw: Res yw dhymm diberth lemmyn.

source: I must leave now.
kw: Res yw dhymm diberth lemmyn.

source: I don't like coffee.
kw: Nyns yw da genev koffi.

source: Helen is seventeen years old.
kw: Seytek bloodh yw Helen.

source: Helen, this is my cousin.
kw: Helen, homm yw ow heniterow.

source: Thank you for your present.
kw: Meur ras a’th ro.

source: Do you like French wines?
kw: Yw da genes gwin frynkek?

source: Mrs. Brown understands Japanese.
kw: Mres Brown a gonvedh Nihonek.

source: Bill has many friends.
kw: Yma lies kothman dhe Wella.

source: I have a bad headache.
kw: Yma drog penn bras dhymm.

source: It was dreadful weather.
kw: Kewer euthyk o.

source: Pass me the butter, please.
kw: Ystynn dhymm an amanyn, mar pleg.

source: Yes, she will.
kw: Mynn.

source: Yes, two.
kw: Eus, yma dew.

source: Why?
kw: Prag?

source: It can be used as a knife.
kw: Y hyllir y usya avel kollel.

source: How's the weather?
kw: Fatel yw an gewer?

source: Why do you want stamps?
kw: Prag y fynn'ta kavos stampow?

source: Tracy lost her glasses.
kw: Tracy a gollas hy dewweder.

source: Where was Tom born?
kw: Ple feu Tom genys?

source: Tom doesn't like cheese.
kw: Nyns yw da gans Tom keus.

source: Tom can swim as fast as you.
kw: Tom a yll neuvya mar skav avelos.

source: I was very hungry.
kw: Yma nown bras dhymm.

source: Give me five tokens, please.
kw: Ro dhymm pymp tokyn, mar pleg.

source: Please forgive me.
kw: Gav dhymm, mar pleg.

source: Where is the toilet?
kw: Ple'ma an bisva?

source: German is not an easy language.
kw: Nyns yw Almaynek yeth es.

source: Don't open the door.
kw: Na wra ygeri an daras.

source: Mary likes watching TV.
kw: Da yw gans Maria mires orth an bellwolok.

source: There is a book on the table.
kw: Yma lyver war an voos.

source: There are no oranges on the table.
kw: Nyns eus owravalow war an voos.

source: Come here.
kw: Deus omma.

source: Give me a drink, please.
kw: Ro dhymm diwes, mar pleg.

source: I don't have a ticket.
kw: Ny’m beus tokyn.

source: I don't smoke.
kw: Ny vogav.

source: Turn it off.
kw: Skwych ev yn farow.

source: It is a book.
kw: Hemm yw lyver.

source: Is it a butterfly or a moth?
kw: Yw ev tykki Duw po godhan?

source: That's my dictionary.
kw: Henn yw ow gerlyver.

source: I think it's a good idea.
kw: Tybyans da yw, dell brederav.

source: What is it?
kw: Pyth yw?

source: Where is the book?
kw: Ple'ma an lyver?

source: There wasn't anyone in the room.
kw: Nyns esa den vyth y’n stevel.

source: The beautiful woman is kind.
kw: Kuv yw an venyn deg.

source: That store sells meat and fish.
kw: Kig ha pysk a werth an gwerthji na.

source: The bird is in its nest.
kw: Yma’n edhen yn hy neyth.

source: Is the bird alive or dead?
kw: Yw an edhen byw po marow?

source: There is a market in the town.
kw: Yma marghas y’n dre.

source: Who wrote the letter?
kw: Piw a skrifas an lyther?

source: The dog wants to go outside.
kw: An ki a vynn mos yn-mes.

source: The dog's name is Ken.
kw: Hanow an ki yw Ken.

source: I like the dog.
kw: Da yw genev an ki.

source: Where is the bank?
kw: Ple’ma’n arghantti?

source: The church stands on the hill.
kw: Yma’n eglos war an vre.

source: How's the weather there?
kw: Fatel yw an gewer ena?

source: How is the weather there?
kw: Fatel yw an gewer ena?

source: This chair is ugly.
kw: An gador ma yw hager.

source: Mr Smith is a good teacher.
kw: Mr Smith yw dyskador da.

source: I like sport.
kw: Da yw genev sport.

source: Brilliant!
kw: Bryntin!

source: I'm coming.
kw: Yth esov vy ow tos.

source: Come back soon.
kw: Dehwel yn skon!

source: John is my nephew.
kw: Yowann yw ow noy.

source: I'd like to speak to John Warner.
kw: My a garsa kewsel orth John Warner.

source: I'd like to speak to Judy.
kw: My a garsa kewsel orth Judy.

source: Jane comes from Australia.
kw: A Ostrali yth yw Jane devedhys.

source: Jane seems to have a new boyfriend.
kw: Yma karer nowydh dhe Jane, dell hevel.

source: Goodbye, Sayoko.
kw: Duw genes, Sayoko.

source: Would you like a cup of tea now?
kw: A garses ta kavos hanafas a de lemmyn?

source: Hello, Tom.
kw: Dydh da, Tom.

source: Who broke this?
kw: Piw a dorras hemma?

source: These are my books.
kw: An re ma yw ow lyvrow.

source: These are my pencils.
kw: An re ma yw ow fluvennow blomm.

source: These are our desks.
kw: An re ma yw agan deskys.

source: These books are new.
kw: An lyvrow ma yw nowydh.

source: These cars are big.
kw: An kerri ma yw bras.

source: Their cakes are good.
kw: Da ya aga thesennow.

source: These dogs are big.
kw: Bras yw an keun ma.

source: This is a book.
kw: Hemm yw lyver.

source: This is their house.
kw: Hemm yw aga chi.

source: This is a map.
kw: Mappa yw hemma.

source: This is the house where my uncle lives.
kw: Hemm yw an chi mayth yw ow ewnter trigys.

source: This is a dog.
kw: Hemm yw ki.

source: Is this your bicycle?
kw: Yw hemma dha dhiwros?

source: This is for you.
kw: Ragos sy yw hemma.

source: I don't like this one.
kw: Nyns yw da genev an onan ma.

source: I don't like this.
kw: Nyns yw da genev hemma.

source: This is a desk.
kw: Desk yw hemma.

source: This is a painting.
kw: Liwans yw hemma.

source: This is a pencil.
kw: Pluven blomm yw homma.

source: Is this a radio?
kw: Yw hemma radyo?

source: This is Mary's dog.
kw: Hemm yw ki Mary.

source: This is a pen.
kw: Homm yw pluven.

source: Is this your car?
kw: Yw hemma dha garr?

source: This one is similar to that one.
kw: An onan ma yw haval orth an onan na.

source: Is this your book?
kw: Yw hemma dha lyver?

source: This is your book.
kw: Hemm yw dha lyver.

source: Is that your room?
kw: Yw honna dha stevel?

source: Is this your pen?
kw: Yw homma dha bluven?

source: Is this a river?
kw: Yw homma avon?

source: This apple is bad.
kw: Drog yw an aval ma.

source: Read this book.
kw: Red an lyver ma.

source: This book is new.
kw: Nowydh yw an lyver ma.

source: This book was new.
kw: Nowydh o an lyver ma.

source: This book is small.
kw: Byghan yw an lyver ma.

source: This book is heavy.
kw: An lyver ma yw poos.

source: This book is old.
kw: Koth yw an lyver ma.

source: This story is true.
kw: An hwedhel ma yw gwir.

source: Don't read in this room.
kw: Na red y’n stevel-ma.

source: This is good meat.
kw: Hemm yw kig da.

source: Are there any bags in this shop?
kw: Eus seghyer y’n gwerthji ma?

source: This river is beautiful.
kw: Teg yw an avon ma.

source: This dog is big.
kw: An ki ma yw bras.

source: What is the meaning of this phrase?
kw: Pyth yw styr an lavar-ma?

source: This fish is big.
kw: Bras yw an pysk ma.

source: This desk is good.
kw: Da yw an desk ma.

source: This apple is sweet.
kw: Hweg yw an aval ma.

source: May I use this pen?
kw: A allav vy usya an bluven ma?

source: This coffee is not hot enough.
kw: Nyns yw tomm lowr an koffi-ma.

source: This coat is warm.
kw: Tomm yw an kota ma.

source: This cake is sweet.
kw: Hweg yw an desen ma.

source: This is my daughter.
kw: Ow myrgh yw homma.

source: Here is your key.
kw: Ottomma dha alhwedh.

source: This is a hospital.
kw: Hemm yw klavji.

source: Where is this?
kw: Ple'ma hemma?

source: There are five pencils here.
kw: Yma pymp pluven blomm omma.

source: Here is your dog.
kw: Ottomma dha gi.

source: Three coffees, please.
kw: Tri hoffi, mar pleg.

source: Would you like another cup of coffee?
kw: A garses ta kavos hanafas aral a goffi?

source: Ken is happy.
kw: Lowen yw Ken.

source: I like to listen to classical music.
kw: Da yw genev goslowes orth ilow klassek.

source: Thank you for the beautiful flowers.
kw: Meur ras dhis a’n bleujyow teg.

source: Today is Sunday.
kw: dy'Sul yw hedhyw.

source: Where did you go yesterday?
kw: Dhe by le y hwrussys ta mos de?

source: It rained yesterday.
kw: Hi a wrug glaw de.

source: I can't eat meat.
kw: Ny allav vy dybri kig.

source: How is the weather?
kw: Fatel yw an gewer?

source: I'd like a cup of tea.
kw: My a garsa kavos hanafas a de.

source: Your dog is very big.
kw: Dha gi yw pur vras.

source: You'll have to wait.
kw: Res vydh dhis gortos.

source: Good-bye!
kw: Duw genes!

source: What's your daughter's name?
kw: Pyth yw hanow dha vyrgh?

source: Could you help me?
kw: A allses ta ow gweres?

source: I received your letter.
kw: My a dhegemeras dha lyther.

source: Good night, Mom.
kw: Nos da, Mammik.

source: My aunt has three children.
kw: Yma dhe’m modrep tri flogh.

source: I was hungry.
kw: Yth esa nown dhymm.

source: Ottawa is the capital of Canada.
kw: Ottawa yw penncita Canada.

source: Our cat is in the kitchen.
kw: Yma’gan kath y’n gegin.

source: I have a headache now.
kw: Yma drog penn dhymm lemmyn.

source: I am coming.
kw: Yth esov vy ow tos.

source: I've got a good idea.
kw: Yma tybyans da dhymm.

source: Happy Easter!
kw: Pask lowen!

source: What's that?
kw: Pyth yw henna?

source: Those are their books.
kw: An re na yw aga lyvrow.

source: Those are my books.
kw: An re na yw ow lyvrow.

source: Those are our books.
kw: An re na yw agan lyvrow.

source: Those houses are big.
kw: An chiow na yw bras.

source: Those apples are big.
kw: An avalow na yw bras.

source: Those dogs are big.
kw: Bras yw an keun na.

source: That is her house.
kw: Henn yw hy chi.

source: That is his house.
kw: Henn yw y ji.

source: That is his car.
kw: Henn yw y garr.

source: Is that a cat or a dog?
kw: Yw henna kath po ki?

source: That is our school.
kw: Honn yw agan skol.

source: Is that a cat?
kw: Yw honna kath?

source: That is a table.
kw: Honn yw moos.

source: That is your book.
kw: Henn yw dha lyver.

source: That is my school.
kw: Honn yw ow skol.

source: That book is a new book.
kw: Lyver nowyth yw an lyver na.

source: The lady that is speaking to that boy is his teacher.
kw: Y dhyskadores yw an venyn usi ow kewsel orth an maw na.

source: That castle is beautiful.
kw: Teg yw an kastel na.

source: That boy is running.
kw: Yma an maw na ow ponya.

source: That boy is speaking English.
kw: Yma’n maw na ow kewsel Sowsnek.

source: That woman has two bags.
kw: Yma dhe’n venyn na dew sagh.

source: Is that dog male or female?
kw: Yw an ki na gorow po benow?

source: That house is big.
kw: Bras yw an chi na.

source: That dog is big.
kw: An ki ma yw bras.

source: I'm sorry, I can't help you.
kw: Drog yw genev, ny allav dha weres.

source: You have a lot of books.
kw: Yma dhis lies lyver.

source: You don't have to study.
kw: Nyns yw res dhis studhya.

source: Are you studying?
kw: Esos ta ow studhya?

source: You are a beautiful butterfly.
kw: Tykki Duw teg os.

source: Do you speak Japanese?
kw: A wre’ta kewsel nihonek?

source: You have two books.
kw: Yma dew lyver dhis.

source: Do you have any money?
kw: Eus arghans dhis?

source: Do you have a car?
kw: Eus dhis karr-tan?

source: I hope that you'll help me.
kw: My a wayt y fynnydh ow gweres.

source: You must do work.
kw: Res yw dhis gul ober.

source: You had to come yesterday.
kw: Res o dhis dos de.

source: You don't have to work today.
kw: Nyns yw res dhis oberi hedhyw.

source: Do you like black cats?
kw: Yw da genes kathes du?

source: You don't need to go.
kw: Nyns yw res dhis mos.

source: Are you a student?
kw: Os ta studhyer?

source: You must go home.
kw: Res yw dhis mos tre.

source: You don't like music.
kw: Nyns yw da genes ilow.

source: You have to speak English.
kw: Res yw dhis kewsel Sowsnek.

source: Do you like English?
kw: Yw da genes Sowsnek?

source: Are you able to swim?
kw: A yll’ta neuvya?

source: Do you know how to swim?
kw: A wodhes neuvya?

source: Where did you see Nancy?
kw: Ple hwelsys ta Nancy?

source: You can dance, can't you?
kw: Ty a yll donsya, a ny yll'ta?

source: You don't have to go there.
kw: Nyns yw res dhis mos ena.

source: You must start soon.
kw: Res yw dhis dalleth skon.

source: You don't have to answer this question.
kw: Nyns yw res dhis gorthebi an govyn ma.

source: You must help your mother.
kw: Res yw dhis gweres dha vamm.

source: You came at five.
kw: Ty a wra dos dhe bymp eur.

source: You have three pens.
kw: Yma teyr fluven dhis.

source: You have four dogs.
kw: Yma peswar ki dhis.

source: You have two flowers.
kw: Yma diw vleujen dhis.

source: Do you like to study?
kw: Yw da genes studhya?

source: What is your name?
kw: Pyth yw dha hanow?

source: You have two brothers.
kw: Yma dew vroder dhis.

source: Do it yourself.
kw: Gwra e’ dha honan.

source: Can you come at nine?
kw: A yll'ta dos dhe naw eur?

source: Four multiplied by two is eight.
kw: Peswar gweyth dew yw eth.

source: There were three men.
kw: Yth esa tri den.

source: A dog is running in the park.
kw: Yma ki ow ponya y'n park.

source: I must buy one.
kw: Res yw dhymm prena onan.

source: I am 19 years old.
kw: Nownsek bloodh ov.

source: Ken's dog is white.
kw: Gwynn yw ki Ken.

source: Ken has a white dog.
kw: Yma ki gwynn dhe Ken.

source: Is the dog swimming?
kw: Usi an ki ow neuvya?

source: Dogs can swim.
kw: Keun a yll neuvya.

source: Fine, thank you. And you?
kw: Yn poynt da, meur ras. Ha genes sy?

source: Good luck.
kw: Chons da.

source: Where do you live now?
kw: Ple’th os ta trigys lemmyn?

source: Must I do it now?
kw: Yw res dhymm y wul lemmyn?

source: It is snowing now.
kw: Yma hi ow kul ergh lemmyn.

source: It is seven now.
kw: Seyth eur yw lemmyn.

source: I have been reading this book.
kw: My re bia ow redya an lyver ma.

source: It is raining now.
kw: Hi a wra glaw lemmyn.

source: What are you doing now?
kw: Pyth esos ta ow kul lemmyn?

source: Must I come home now?
kw: Yw res dhymm mos tre lemmyn?

source: We have enough food now.
kw: Yma boos lowr dhyn lemmyn.

source: I'm leaving now.
kw: Yth esov vy ow tiberth lemmyn.

source: How is the weather today?
kw: Fatel yw an gewer hedhyw?

source: It's very cold today.
kw: Pur yeyn yw hi hedhyw.

source: It is very cold today.
kw: Pur yeyn yw hi hedhyw.

source: The wind is cold today.
kw: Yeyn yw an gwyns hedhyw.

source: You don't need to study today.
kw: Nyns yw res dhis studhya hedhyw.

source: Will it rain today?
kw: A wra glaw hedhyw?

source: This winter is warm.
kw: Tomm yw an gwav ma.

source: It will rain tonight.
kw: Hi a vydh glaw haneth.

source: Will it snow tonight?
kw: a vydh hi ergh haneth?

source: Would you like some sugar?
kw: A garses ta kavos nebes sugra?

source: It was cloudy yesterday.
kw: Komolek o de.

source: It was raining yesterday.
kw: Yth esa hi ow kul glaw de.

source: Are you working?
kw: Esos ta owth oberi?

source: He did not like children.
kw: Nyns ow da ganso fleghes.

source: My name is Edgar Degas.
kw: Edgar Degas yw ow hanow.

source: Do I need to go there?
kw: Yw res dhymm mos ena?

source: We are doctors.
kw: Medhogyon on ni.

source: We own a dog and a cat.
kw: Yma ki ha kath dhyn.

source: We ate breakfast at seven.
kw: Ni a dhybras hansel dhe seyth eur.

source: We are hungry.
kw: Yma nown dhyn.

source: We were looking at the picture.
kw: Yth esen ni ow mires orth an lymnans.

source: We sat in the center of the room.
kw: Yth esen ni a’gan esedh yn kres an stevel.

source: We slept in a tent.
kw: Ni a goskas yn tylda.

source: We must study English.
kw: Res yw dhyn studhya Sowsnek.

source: We live close to the station.
kw: Ogas dhe’n gorsav yth on ni trigys.

source: We must go to school.
kw: Res yw dhyn mos dhe skol.

source: We must leave early.
kw: Res yw dhyn diberth a-varr.

source: We have a cat and a dog.
kw: Yma kath ha ki dhyn.

source: We have two daughters.
kw: Yma diw vyrgh dhyn.

source: I have two brothers and one sister.
kw: Yma dhymm dew vroder hag unn hwor.

source: I have three brothers.
kw: Yma tri broder dhymm.

source: Give me a glass of milk.
kw: Ro dhymm gwedrennas a leth.

source: Please write a letter to me.
kw: Skrif dhymm lyther, mar pleg.

source: Don't forget to write to me.
kw: Na ankov skrifa dhymm.

source: He is my brother.
kw: Ev yw ow broder.

source: My dog has a long tail.
kw: Yma lost hir dhe’m ki.

source: My dog is white.
kw: Gwynn yw ow hi.

source: My dogs are white.
kw: Gwynn yw ow heun.

source: Can you hear me?
kw: A yll’ta ow klewes?

source: Where is my car?
kw: Ple’ma ow harr-tan?

source: My father has many books.
kw: Yma lies lyver dhe’m tas.

source: Where's my book?
kw: Ple’ma ow lyver?

source: I'm very tired.
kw: Pur skwith ov vy.

source: I don't like summer.
kw: Nyns yw da genev hav.

source: I like dogs.
kw: Da yw genev keun.

source: I am a student.
kw: Studhyer ov.

source: I was born in Tokyo in 1968.
kw: Genys veuv yn Tokyo yn 1968.

source: I have been studying for two hours.
kw: My re bia ow studhya rag dew our.

source: I have been studying German for two years.
kw: My re bia ow studhya Almaynek rag diw vledhen.

source: I have been studying English for four years.
kw: My re bia ow studhya Sowsnek rag peswar bledhen.

source: I had to go to America.
kw: Res o dhymm mos dhe Amerika.

source: I have a big dog.
kw: Yma ki bras dhymm.

source: I like tea.
kw: Da yw genev te.

source: I have a pretty dog.
kw: Yma ki teg dhymm.

source: I must leave here today.
kw: Res yw dhymm diberth omma hedhyw.

source: I like cake.
kw: Da yw genev tesen.

source: I have been waiting here for two hours.
kw: My re bia ow kortos omma rag dew our.

source: I have been living here for three years.
kw: My re bia ow triga omma rag teyr bledhen.

source: I don't like this hat.
kw: Nyns yw da genev an hatt ma.

source: I have a computer.
kw: Yma jynn-amontya dhymm.

source: I've been working there for three months.
kw: My re bia owth oberi ena rag tri mis.

source: I must go there.
kw: Res yw dhymm mos ena.

source: I don't like the coffee.
kw: Nyns yw da genev an koffi.

source: I must open the window.
kw: Res yw dhymm ygeri an fenester.

source: I've seen it.
kw: My re welas henna.

source: I don't know that.
kw: Ny wonn henna.
